sessions/F03-market-open-connection-storm/results/raw/pool20-r1-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 2600 max VUs, 1m0s max duration (incl. graceful stop):
              * market_open: Up to 400.00 iterations/s for 30s over 3 stages (maxVUs: 2600, gracefulStop: 30s)


running (0m00.8s), 0004/2600 VUs, 23 complete and 0 interrupted iterations
market_open   [   3% ] 0004/2600 VUs  00.8s/30s  066.33 iters/s

running (0m01.8s), 0008/2600 VUs, 125 complete and 0 interrupted iterations
market_open   [   6% ] 0008/2600 VUs  01.8s/30s  146.15 iters/s

running (0m02.8s), 0013/2600 VUs, 306 complete and 0 interrupted iterations
market_open   [   9% ] 0013/2600 VUs  02.8s/30s  226.10 iters/s

running (0m03.8s), 0016/2600 VUs, 568 complete and 0 interrupted iterations
market_open   [  13% ] 0016/2600 VUs  03.8s/30s  305.81 iters/s

running (0m04.8s), 0020/2600 VUs, 910 complete and 0 interrupted iterations
market_open   [  16% ] 0020/2600 VUs  04.8s/30s  385.85 iters/s

running (0m05.8s), 0018/2600 VUs, 1311 complete and 0 interrupted iterations
market_open   [  19% ] 0018/2600 VUs  05.8s/30s  400.00 iters/s

running (0m06.8s), 0020/2600 VUs, 1709 complete and 0 interrupted iterations
market_open   [  23% ] 0020/2600 VUs  06.8s/30s  400.00 iters/s

running (0m07.8s), 0020/2600 VUs, 2109 complete and 0 interrupted iterations
market_open   [  26% ] 0020/2600 VUs  07.8s/30s  400.00 iters/s

running (0m08.8s), 0020/2600 VUs, 2509 complete and 0 interrupted iterations
market_open   [  29% ] 0020/2600 VUs  08.8s/30s  400.00 iters/s

running (0m09.8s), 0020/2600 VUs, 2909 complete and 0 interrupted iterations
market_open   [  33% ] 0020/2600 VUs  09.8s/30s  400.00 iters/s

running (0m10.8s), 0019/2600 VUs, 3310 complete and 0 interrupted iterations
market_open   [  36% ] 0019/2600 VUs  10.8s/30s  400.00 iters/s

running (0m11.8s), 0019/2600 VUs, 3710 complete and 0 interrupted iterations
market_open   [  39% ] 0019/2600 VUs  11.8s/30s  400.00 iters/s

running (0m12.8s), 0020/2600 VUs, 4109 complete and 0 interrupted iterations
market_open   [  43% ] 0020/2600 VUs  12.8s/30s  400.00 iters/s

running (0m13.8s), 0020/2600 VUs, 4509 complete and 0 interrupted iterations
market_open   [  46% ] 0020/2600 VUs  13.8s/30s  400.00 iters/s

running (0m14.8s), 0019/2600 VUs, 4910 complete and 0 interrupted iterations
market_open   [  49% ] 0019/2600 VUs  14.8s/30s  400.00 iters/s

running (0m15.8s), 0020/2600 VUs, 5310 complete and 0 interrupted iterations
market_open   [  53% ] 0020/2600 VUs  15.8s/30s  400.00 iters/s

running (0m16.8s), 0020/2600 VUs, 5709 complete and 0 interrupted iterations
market_open   [  56% ] 0020/2600 VUs  16.8s/30s  400.00 iters/s

running (0m17.8s), 0019/2600 VUs, 6110 complete and 0 interrupted iterations
market_open   [  59% ] 0019/2600 VUs  17.8s/30s  400.00 iters/s

running (0m18.8s), 0020/2600 VUs, 6509 complete and 0 interrupted iterations
market_open   [  63% ] 0020/2600 VUs  18.8s/30s  400.00 iters/s

running (0m19.8s), 0021/2600 VUs, 6908 complete and 0 interrupted iterations
market_open   [  66% ] 0021/2600 VUs  19.8s/30s  400.00 iters/s

running (0m20.8s), 0018/2600 VUs, 7311 complete and 0 interrupted iterations
market_open   [  69% ] 0018/2600 VUs  20.8s/30s  400.00 iters/s

running (0m21.8s), 0020/2600 VUs, 7709 complete and 0 interrupted iterations
market_open   [  73% ] 0020/2600 VUs  21.8s/30s  400.00 iters/s

running (0m22.8s), 0019/2600 VUs, 8109 complete and 0 interrupted iterations
market_open   [  76% ] 0019/2600 VUs  22.8s/30s  400.00 iters/s

running (0m23.8s), 0020/2600 VUs, 8510 complete and 0 interrupted iterations
market_open   [  79% ] 0020/2600 VUs  23.8s/30s  400.00 iters/s

running (0m24.8s), 0021/2600 VUs, 8909 complete and 0 interrupted iterations
market_open   [  83% ] 0021/2600 VUs  24.8s/30s  400.00 iters/s

running (0m25.8s), 0018/2600 VUs, 9284 complete and 0 interrupted iterations
market_open   [  86% ] 0018/2600 VUs  25.8s/30s  334.07 iters/s

running (0m26.8s), 0014/2600 VUs, 9582 complete and 0 interrupted iterations
market_open   [  89% ] 0014/2600 VUs  26.8s/30s  254.09 iters/s

running (0m27.8s), 0010/2600 VUs, 9800 complete and 0 interrupted iterations
market_open   [  93% ] 0010/2600 VUs  27.8s/30s  174.13 iters/s

running (0m28.8s), 0005/2600 VUs, 9939 complete and 0 interrupted iterations
market_open   [  96% ] 0005/2600 VUs  28.8s/30s  094.23 iters/s

running (0m29.8s), 0001/2600 VUs, 9997 complete and 0 interrupted iterations
market_open   [  99% ] 0001/2600 VUs  29.8s/30s  015.27 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 39996  1332.690792/s
    checks_succeeded...: 25.00% 9999 out of 39996
    checks_failed......: 75.00% 29997 out of 39996

    ✗ 200 정상 응답
      ↳  93% — ✓ 9375 / ✗ 624
    ✗ 503 부하 차단(의도된 흘려보냄)
      ↳  6% — ✓ 624 / ✗ 9375
    ✗ 500 서버오류(커넥션 타임아웃)
      ↳  0% — ✓ 0 / ✗ 9999
    ✗ 응답 못 받음(status 0)
      ↳  0% — ✓ 0 / ✗ 9999

    CUSTOM
    cnt_200........................: 9375   312.380642/s
    cnt_503........................: 624    20.792056/s
    dur_200_ok.....................: avg=51.94ms  min=50.4ms   med=51.62ms  max=84.1ms  p(90)=53.3ms   p(95)=54.12ms
    dur_503_shed...................: avg=441.48µs min=183.54µs med=342.31µs max=6.49ms  p(90)=673.83µs p(95)=1.04ms 

    HTTP
    http_req_duration..............: avg=48.73ms  min=183.54µs med=51.55ms  max=84.1ms  p(90)=53.21ms  p(95)=54.03ms
      { expected_response:true }...: avg=51.94ms  min=50.4ms   med=51.62ms  max=84.1ms  p(90)=53.3ms   p(95)=54.12ms
    http_req_failed................: 6.24%  624 out of 9999
    http_reqs......................: 9999   333.172698/s

    EXECUTION
    iteration_duration.............: avg=48.92ms  min=232.45µs med=51.69ms  max=85.59ms p(90)=53.54ms  p(95)=54.4ms 
    iterations.....................: 9999   333.172698/s
    vus............................: 1      min=1           max=21  
    vus_max........................: 2600   min=2600        max=2600

    NETWORK
    data_received..................: 1.3 MB 43 kB/s
    data_sent......................: 750 kB 25 kB/s



running (0m30.0s), 0000/2600 VUs, 9999 complete and 0 interrupted iterations
market_open ✓ [ 100% ] 0000/2600 VUs  30s  006.32 iters/s