sessions/F03-market-open-connection-storm/results/raw/pool20-r2-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 2600 max VUs, 1m0s max duration (incl. graceful stop):
              * market_open: Up to 400.00 iterations/s for 30s over 3 stages (maxVUs: 2600, gracefulStop: 30s)


running (0m00.8s), 0005/2600 VUs, 23 complete and 0 interrupted iterations
market_open   [   3% ] 0005/2600 VUs  00.8s/30s  067.53 iters/s

running (0m01.8s), 0008/2600 VUs, 126 complete and 0 interrupted iterations
market_open   [   6% ] 0008/2600 VUs  01.8s/30s  146.70 iters/s

running (0m02.8s), 0011/2600 VUs, 310 complete and 0 interrupted iterations
market_open   [   9% ] 0011/2600 VUs  02.8s/30s  226.80 iters/s

running (0m03.8s), 0016/2600 VUs, 573 complete and 0 interrupted iterations
market_open   [  13% ] 0016/2600 VUs  03.8s/30s  307.12 iters/s

running (0m04.8s), 0020/2600 VUs, 915 complete and 0 interrupted iterations
market_open   [  16% ] 0020/2600 VUs  04.8s/30s  386.89 iters/s

running (0m05.8s), 0020/2600 VUs, 1314 complete and 0 interrupted iterations
market_open   [  19% ] 0020/2600 VUs  05.8s/30s  400.00 iters/s

running (0m06.8s), 0018/2600 VUs, 1716 complete and 0 interrupted iterations
market_open   [  23% ] 0018/2600 VUs  06.8s/30s  400.00 iters/s

running (0m07.8s), 0019/2600 VUs, 2115 complete and 0 interrupted iterations
market_open   [  26% ] 0019/2600 VUs  07.8s/30s  400.00 iters/s

running (0m08.8s), 0019/2600 VUs, 2515 complete and 0 interrupted iterations
market_open   [  29% ] 0019/2600 VUs  08.8s/30s  400.00 iters/s

running (0m09.8s), 0021/2600 VUs, 2914 complete and 0 interrupted iterations
market_open   [  33% ] 0021/2600 VUs  09.8s/30s  400.00 iters/s

running (0m10.8s), 0019/2600 VUs, 3316 complete and 0 interrupted iterations
market_open   [  36% ] 0019/2600 VUs  10.8s/30s  400.00 iters/s

running (0m11.8s), 0019/2600 VUs, 3715 complete and 0 interrupted iterations
market_open   [  39% ] 0019/2600 VUs  11.8s/30s  400.00 iters/s

running (0m12.8s), 0018/2600 VUs, 4116 complete and 0 interrupted iterations
market_open   [  43% ] 0018/2600 VUs  12.8s/30s  400.00 iters/s

running (0m13.8s), 0020/2600 VUs, 4515 complete and 0 interrupted iterations
market_open   [  46% ] 0020/2600 VUs  13.8s/30s  400.00 iters/s

running (0m14.8s), 0020/2600 VUs, 4914 complete and 0 interrupted iterations
market_open   [  49% ] 0020/2600 VUs  14.8s/30s  400.00 iters/s

running (0m15.8s), 0020/2600 VUs, 5314 complete and 0 interrupted iterations
market_open   [  53% ] 0020/2600 VUs  15.8s/30s  400.00 iters/s

running (0m16.8s), 0020/2600 VUs, 5715 complete and 0 interrupted iterations
market_open   [  56% ] 0020/2600 VUs  16.8s/30s  400.00 iters/s

running (0m17.8s), 0019/2600 VUs, 6116 complete and 0 interrupted iterations
market_open   [  59% ] 0019/2600 VUs  17.8s/30s  400.00 iters/s

running (0m18.8s), 0020/2600 VUs, 6514 complete and 0 interrupted iterations
market_open   [  63% ] 0020/2600 VUs  18.8s/30s  400.00 iters/s

running (0m19.8s), 0020/2600 VUs, 6914 complete and 0 interrupted iterations
market_open   [  66% ] 0020/2600 VUs  19.8s/30s  400.00 iters/s

running (0m20.8s), 0020/2600 VUs, 7315 complete and 0 interrupted iterations
market_open   [  69% ] 0020/2600 VUs  20.8s/30s  400.00 iters/s

running (0m21.8s), 0021/2600 VUs, 7714 complete and 0 interrupted iterations
market_open   [  73% ] 0021/2600 VUs  21.8s/30s  400.00 iters/s

running (0m22.8s), 0020/2600 VUs, 8114 complete and 0 interrupted iterations
market_open   [  76% ] 0020/2600 VUs  22.8s/30s  400.00 iters/s

running (0m23.8s), 0019/2600 VUs, 8516 complete and 0 interrupted iterations
market_open   [  79% ] 0019/2600 VUs  23.8s/30s  400.00 iters/s

running (0m24.8s), 0018/2600 VUs, 8916 complete and 0 interrupted iterations
market_open   [  83% ] 0018/2600 VUs  24.8s/30s  400.00 iters/s

running (0m25.8s), 0018/2600 VUs, 9288 complete and 0 interrupted iterations
market_open   [  86% ] 0018/2600 VUs  25.8s/30s  333.11 iters/s

running (0m26.8s), 0013/2600 VUs, 9586 complete and 0 interrupted iterations
market_open   [  89% ] 0013/2600 VUs  26.8s/30s  253.14 iters/s

running (0m27.8s), 0010/2600 VUs, 9803 complete and 0 interrupted iterations
market_open   [  93% ] 0010/2600 VUs  27.8s/30s  172.74 iters/s

running (0m28.8s), 0006/2600 VUs, 9940 complete and 0 interrupted iterations
market_open   [  96% ] 0006/2600 VUs  28.8s/30s  092.52 iters/s

running (0m29.8s), 0001/2600 VUs, 9997 complete and 0 interrupted iterations
market_open   [  99% ] 0001/2600 VUs  29.8s/30s  015.27 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 39996  1332.864629/s
    checks_succeeded...: 25.00% 9999 out of 39996
    checks_failed......: 75.00% 29997 out of 39996

    ✗ 200 정상 응답
      ↳  93% — ✓ 9394 / ✗ 605
    ✗ 503 부하 차단(의도된 흘려보냄)
      ↳  6% — ✓ 605 / ✗ 9394
    ✗ 500 서버오류(커넥션 타임아웃)
      ↳  0% — ✓ 0 / ✗ 9999
    ✗ 응답 못 받음(status 0)
      ↳  0% — ✓ 0 / ✗ 9999

    CUSTOM
    cnt_200........................: 9394   313.054564/s
    cnt_503........................: 605    20.161594/s
    dur_200_ok.....................: avg=51.93ms  min=50.39ms  med=51.61ms  max=81.24ms p(90)=53.22ms  p(95)=54.16ms
    dur_503_shed...................: avg=463.26µs min=185.75µs med=338.75µs max=3.97ms  p(90)=808.21µs p(95)=1.16ms 

    HTTP
    http_req_duration..............: avg=48.81ms  min=185.75µs med=51.54ms  max=81.24ms p(90)=53.14ms  p(95)=54.07ms
      { expected_response:true }...: avg=51.93ms  min=50.39ms  med=51.61ms  max=81.24ms p(90)=53.22ms  p(95)=54.16ms
    http_req_failed................: 6.05%  605 out of 9999
    http_reqs......................: 9999   333.216157/s

    EXECUTION
    iteration_duration.............: avg=49ms     min=234.83µs med=51.69ms  max=82.8ms  p(90)=53.44ms  p(95)=54.45ms
    iterations.....................: 9999   333.216157/s
    vus............................: 0      min=0           max=21  
    vus_max........................: 2600   min=2600        max=2600

    NETWORK
    data_received..................: 1.3 MB 43 kB/s
    data_sent......................: 750 kB 25 kB/s



running (0m30.0s), 0000/2600 VUs, 9999 complete and 0 interrupted iterations
market_open ✓ [ 100% ] 0000/2600 VUs  30s  006.32 iters/s